# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. 
# Поскольку разобраться в его кричалках не настолько просто, 
# насколько легко он их придумывает, Вам стоит написать программу. 
# Винни-Пух считает, что ритм есть, если число слогов 
# (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. 
# Фраза может состоять из одного слова, если во фразе несколько слов, 
# то они разделяются дефисами. Фразы отделяются друг от друга пробелами. 
# Стихотворение  Винни-Пух вбивает в программу с клавиатуры. 
# В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, 
# если с ритмом все не в порядке

# *Пример:*

# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да    
#     **Вывод:** Парам пам-пам  

# Решение:

def tact(line):
    line = line.split()
    list_text = []
    for word in line:
        summ = 0
        for i in word:
            if i in 'аеёуоиыэюя':
                summ += 1
        list_text.append(summ)
    return len(list_text) == list_text.count(list_text[0])



line_1 = 'пара-ра-рам рам-пам-папам па-ра-па-дам'
if tact(line_1):
    print('Парам пам-пам')
else:
    print('Пам парам')